davecheney/avr11/cpu.cpp
#include <SdFat.h>
#include <setjmp.h>
#include <stdio.h>

#include "avr11.h"
#include "bootrom.h"


extern struct intr {
  uint8_t vec;
  uint8_t pri;
} itab[ITABN];

namespace mmu {

struct {
  uint32_t par, pdr;
} pages[16];

uint32_t SR0;
uint16_t SR2;

#define READ(x) (x.pdr & 2)
#define WRITE(x) (x.pdr & 6)
#define ED(x) (x.pdr & 8)
#define LEN(x) ((x.pdr >> 8) & 0x7f)
#define ADDR(x) (x.par & 07777)
#define BLOCK(x) ((x >> 6) & 0177)
#define DISP(x) (x & 077)

uint32_t decode(const uint32_t a, const bool w, const bool user) {
  if (!(SR0 & 1)) {
    if (a > 0167777)
      return a + 0600000;
    return a;
  }
  const uint8_t i = user ? ((a >> 13) + 8) : (a >> 13);
  if (w && !WRITE(pages[i])) {
    SR0 = (1 << 13) | 1;
    SR0 |= (a >> 12) & ~1;
    if (user) {
      SR0 |= (1 << 5) | (1 << 6);
    }
    SR2 = cpu::PC;

    printf("mmu::decode write to read-only page %06o\n", a);
    trap(INTFAULT);
  }
  if (!READ(pages[i])) {
    SR0 = (1 << 15) | 1;
    SR0 |= (a >> 12) & ~1;
    if (user) {
      SR0 |= (1 << 5) | (1 << 6);
    }
    SR2 = cpu::PC;
    printf("mmu::decode read from no-access page %06o\n", a);
    trap(INTFAULT);
  }
  // if ((p.ed() && (block < p.len())) || (!p.ed() && (block > p.len()))) {
  if (ED(pages[i]) ? (BLOCK(a) < LEN(pages[i])) : (BLOCK(a) > LEN(pages[i]))) {
    SR0 = (1 << 14) | 1;
    SR0 |= (a >> 12) & ~1;
    if (user) {
      SR0 |= (1 << 5) | (1 << 6);
    }
    SR2 = cpu::PC;
    printf("page length exceeded, address %06o (block %03o) is beyond length "
           "%03o\r\n",
           a, BLOCK(a), LEN(pages[i]));
    trap(INTFAULT);
  }
  if (w) {
    pages[i].pdr |= 1 << 6;
  }
  const uint32_t aa = ((ADDR(pages[i]) + BLOCK(a)) << 6 ) + DISP(a);
  if (DEBUG_MMU) {
    printf("decode: slow %06o -> %06o\n", a, aa);
  }

  return aa;
}

#define PAGE(x) ((x & 017) >> 1)

uint16_t read16(const uint32_t a) {
  if ((a >= 0772300) && (a < 0772320)) {
    return pages[PAGE(a)].pdr;
  }
  if ((a >= 0772340) && (a < 0772360)) {
    return pages[PAGE(a)].par;
  }
  if ((a >= 0777600) && (a < 0777620)) {
    return pages[PAGE(a) + 8].pdr;
  }
  if ((a >= 0777640) && (a < 0777660)) {
    return pages[PAGE(a) + 8].par;
  }
  printf("mmu::read16 invalid read from %06o\n", a);
  return trap(INTBUS);
}

void write16(const uint32_t a, const uint16_t v) {
  if ((a >= 0772300) && (a < 0772320)) {
    pages[PAGE(a)].pdr = v;
    return;
  }
  if ((a >= 0772340) && (a < 0772360)) {
    pages[PAGE(a)].par = v;
    return;
  }
  if ((a >= 0777600) && (a < 0777620)) {
    pages[PAGE(a) + 8].pdr = v;
    return;
  }
  if ((a >= 0777640) && (a < 0777660)) {
    pages[PAGE(a) + 8].par = v;
    return;
  }
  printf("mmu::write16 write to invalid address %06o\n", a);
  trap(INTBUS);
}
};

namespace cpu {

uint16_t R[8];

uint16_t PS;       // processor status
uint16_t PC;       // address of current instruction
uint16_t KSP, USP; // kernel and user stack pointer
uint16_t LKS;
bool curuser, prevuser;

void reset(void) {
  LKS = 1 << 7;
  uint16_t i;
  for (i = 0; i < 29; i++) {
    unibus::write16(02000 + (i * 2), bootrom[i]);
  }
  R[7] = 002002;
  /*for (i = 0; i < 8; i++) {
    unibus::write16(01000 + (i * 2), consecho[i]);
  }
  R[7] = 001000;*/
  cons::clearterminal();
  rk11::reset();
}

#define N (PS & FLAGN)
#define Z (PS & FLAGZ)
#define V (PS & FLAGV)
#define C (PS & FLAGC)

#define READ8(a) unibus::read8(mmu::decode(a, false, curuser))
#define READ16(a) unibus::read16(mmu::decode(a, false, curuser))
#define WRITE8(a, v) unibus::write8(mmu::decode(a, true, curuser), v)
#define WRITE16(a, v) unibus::write16(mmu::decode(a, true, curuser), v)

#define WORD 2
#define isWord(x) (x == WORD)
#define isReg(x) ((x & 0177770) == 0170000)
#define setZ(x) if (x == 0) { PS |= FLAGZ; }
#define D(x) (x & 077)
#define S(x) ((x & 07700) >> 6)
#define L(x) (WORD - (x >> 15))
#define SA(x) (aget(S(x), L(x)))
#define DA(x) (aget(D(x), L(x)))
#define MSB(x) ((instr >> 15) ? 0x80 : 0x8000)
#define MAX(x) ((instr >> 15) ? 0xff : 0xffff)

static uint16_t memread16(const uint16_t a) {
  if (isReg(a)) {
    return R[a & 7];
  }
  return READ16(a);
}

static uint16_t memread(const uint32_t a, const uint32_t l) {
  if (isReg(a)) {
    if (isWord(l)) {
      return R[a & 7];
    } else {
      return R[a & 7] & 0xFF;
    }
  }
  if (isWord(l)) {
    return READ16(a);
  }
  return READ8(a);
}

static void memwrite16(const uint32_t a, const uint16_t v) {
  if (isReg(a)) {
    R[a & 7] = v;
  } else {
    WRITE16(a, v);
  }
}

static void memwrite(const uint32_t a, const uint32_t l, const uint16_t v) {
  if (isReg(a)) {
    if (isWord(l)) {
      R[a & 7] = v;
    } else {
      R[a & 7] &= 0xFF00;
      R[a & 7] |= v;
    }
  } else {
    if (isWord(l)) {
      WRITE16(a, v);
    } else {
      WRITE8(a, v);
    }
  }
}

static uint16_t fetch16() {
  const uint16_t val = READ16(R[7]);
  R[7] += 2;
  return val;
}

static void push(const uint16_t v) {
  R[6] -= 2;
  WRITE16(R[6], v);
}

static uint16_t pop() {
  const uint16_t val = READ16(R[6]);
  R[6] += 2;
  return val;
}

// aget resolves the operand to a vaddress.
// if the operand is a register, an address in
// the range [0170000,0170007). This address range is
// technically a valid IO page, but unibus doesn't map
// any addresses here, so we can safely do this.
static uint16_t aget(uint8_t v, uint8_t l) {
  if (!(v & 070))
    return 0170000 | (v & 7);
    
  if (((v & 7) >= 6) || (v & 010)) {
    l = WORD;
  }
  uint16_t addr = 0;
  switch (v & 060) {
    case 000:
      v &= 7;
      addr = R[v & 7];
      break;
    case 020:
      addr = R[v & 7];
      R[v & 7] += l;
      break;
    case 040:
      R[v & 7] -= l;
      addr = R[v & 7];
      break;
    case 060:
      addr = fetch16();
      addr += R[v & 7];
      break;
  }
  if (v & 010) {
    addr = READ16(addr);
  }
  return addr;
}

static void branch(int16_t o) {
  if (o & 0x80) {
    o = -(((~o) + 1) & 0xFF);
  }
  o <<= 1;
  R[7] += o;
}

void switchmode(const bool newm) {
  prevuser = curuser;
  curuser = newm;
  if (prevuser) {
    USP = R[6];
  } else {
    KSP = R[6];
  }
  if (curuser) {
    R[6] = USP;
  } else {
    R[6] = KSP;
  }
  PS &= 0007777;
  if (curuser) {
    PS |= (1 << 15) | (1 << 14);
  }
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
}

static void MOV(const uint16_t instr) {
  uint16_t uval = memread(SA(instr), L(instr));
  const uint16_t da = DA(instr);
  PS &= 0xFFF1;
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  setZ(uval);
  if ((isReg(da)) && !isWord(L(instr))) {
    if (uval & MSB(instr)) {
      uval |= 0xFF00;
    }
    memwrite(da, WORD, uval);
  } else {
    memwrite(da, L(instr), uval);
  }
}

static void CMP(const uint16_t instr) {
  const uint16_t val1 = memread(SA(instr), L(instr));
  const uint16_t val2 = memread(DA(instr), L(instr));
  const int32_t sval = (val1 - val2) & MAX(instr);
  PS &= 0xFFF0;
  setZ(sval);
  if (sval & MSB(instr)) {
    PS |= FLAGN;
  }
  if (((val1 ^ val2) & MSB(instr)) && (!((val2 ^ sval) & MSB(instr)))) {
    PS |= FLAGV;
  }
  if (val1 < val2) {
    PS |= FLAGC;
  }
}

static void BIT(const uint16_t instr) {
  const uint16_t val1 = memread(SA(instr), L(instr));
  const uint16_t val2 = memread(DA(instr), L(instr));
  const uint16_t uval = val1 & val2;
  PS &= 0xFFF1;
  setZ(uval);
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
}

static void BIC(const uint16_t instr) {
  const uint16_t val1 = memread(SA(instr), L(instr));
  const uint16_t da = DA(instr);
  const uint16_t val2 = memread(da, L(instr));
  const uint16_t uval = (MAX(instr) ^ val1) & val2;
  PS &= 0xFFF1;
  setZ(uval);
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  memwrite(da, L(instr), uval);
}

static void BIS(const uint16_t instr) {
  const uint16_t val1 = memread(SA(instr), L(instr));
  const uint16_t da = DA(instr);
  const uint16_t val2 = memread(da, L(instr));
  const uint16_t uval = val1 | val2;
  PS &= 0xFFF1;
  setZ(uval);
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  memwrite(da, L(instr), uval);
}

static void ADD(const uint16_t instr) {
  const uint32_t val1 = memread16(aget(S(instr), WORD));
  const uint16_t da = aget(D(instr), WORD);
  const uint32_t val2 = memread16(da);
  const uint16_t uval = val1 + val2;
  PS &= 0xFFF0;
  setZ(uval);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
  if (!((val1 ^ val2) & 0x8000) && ((val2 ^ uval) & 0x8000)) {
    PS |= FLAGV;
  }
  if ((val1 + val2) >= 0xFFFF) {
    PS |= FLAGC;
  }
  memwrite16(da, uval);
}

static void SUB(const uint16_t instr) {
  const uint16_t val1 = memread16(aget(S(instr), WORD));
  const uint16_t da = aget(D(instr), WORD);
  const uint16_t val2 = memread16(da);
  const uint16_t uval = val2 - val1;
  PS &= 0xFFF0;
  setZ(uval);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
  if (((val1 ^ val2) & 0x8000) && (!((val2 ^ uval) & 0x8000))) {
    PS |= FLAGV;
  }
  if (val1 > val2) {
    PS |= FLAGC;
  }
  memwrite16(da, uval);
}

static void JSR(const uint16_t instr) {
  const uint16_t uval = DA(instr);
  if (isReg(uval)) {
    printf("JSR called on registeri\n");
    panic();
  }
  push(R[S(instr) & 7]);
  R[S(instr) & 7] = R[7];
  R[7] = uval;
}

static void MUL(const uint16_t instr) {
  int32_t val1 = R[S(instr) & 7];
  if (val1 & 0x8000) {
    val1 = -((0xFFFF ^ val1) + 1);
  }
  uint16_t da = DA(instr);
  int32_t val2 = memread16(da);
  if (val2 & 0x8000) {
    val2 = -((0xFFFF ^ val2) + 1);
  }
  const int32_t sval = val1 * val2;
  R[S(instr) & 7] = sval >> 16;
  R[(S(instr) & 7) | 1] = sval & 0xFFFF;
  PS &= 0xFFF0;
  if (sval & 0x80000000) {
    PS |= FLAGN;
  }
  setZ((sval & 0xFFFFFFFF));
  if ((sval < (1 << 15)) || (sval >= ((1L << 15) - 1))) {
    PS |= FLAGC;
  }
}

static void DIV(const uint16_t instr) {
  const int32_t val1 = (R[S(instr) & 7] << 16) | (R[(S(instr) & 7) | 1]);
  const int32_t val2 = memread16(DA(instr));
  PS &= 0xFFF0;
  if (val2 == 0) {
    PS |= FLAGC;
    return;
  }
  if ((val1 / val2) >= 0x10000) {
    PS |= FLAGV;
    return;
  }
  R[S(instr) & 7] = (val1 / val2) & 0xFFFF;
  R[(S(instr) & 7) | 1] = (val1 % val2) & 0xFFFF;
  setZ(R[S(instr) & 7]);
  if (R[S(instr) & 7] & 0100000) {
    PS |= FLAGN;
  }
  if (val1 == 0) {
    PS |= FLAGV;
  }
}

static void ASH(const uint16_t instr) {
  const uint16_t val1 = R[S(instr) & 7];
  const uint16_t da = aget(D(instr), WORD);
  uint16_t val2 = memread16(da) & 077;
  PS &= 0xFFF0;
  int32_t sval;
  if (val2 & 040) {
    val2 = (077 ^ val2) + 1;
    if (val1 & 0100000) {
      sval = 0xFFFF ^ (0xFFFF >> val2);
      sval |= val1 >> val2;
    } else {
      sval = val1 >> val2;
    }
    if (val1 & (1 << (val2 - 1))) {
      PS |= FLAGC;
    }
  } else {
    sval = (val1 << val2) & 0xFFFF;
    if (val1 & (1 << (16 - val2))) {
      PS |= FLAGC;
    }
  }
  R[S(instr) & 7] = sval;
  setZ(sval);
  if (sval & 0100000) {
    PS |= FLAGN;
  }
  if ((sval & 0100000)xor(val1 & 0100000)) {
    PS |= FLAGV;
  }
}

