davecheney/avr11/cpu.cpp
static void ASHC(const uint16_t instr) {
  const uint32_t val1 = R[S(instr) & 7] << 16 | R[(S(instr) & 7) | 1];
  const uint16_t da = aget(D(instr), WORD);
  uint16_t val2 = memread16(da) & 077;
  PS &= 0xFFF0;
  int32_t sval;
  if (val2 & 040) {
    val2 = (077 ^ val2) + 1;
    if (val1 & 0x80000000) {
      sval = 0xFFFFFFFF ^ (0xFFFFFFFF >> val2);
      sval |= val1 >> val2;
    } else {
      sval = val1 >> val2;
    }
    if (val1 & (1 << (val2 - 1))) {
      PS |= FLAGC;
    }
  } else {
    sval = (val1 << val2) & 0xFFFFFFFF;
    if (val1 & (1 << (32 - val2))) {
      PS |= FLAGC;
    }
  }
  R[S(instr) & 7] = (sval >> 16) & 0xFFFF;
  R[(S(instr) & 7) | 1] = sval & 0xFFFF;
  setZ(sval);
  if (sval & 0x80000000) {
    PS |= FLAGN;
  }
  if ((sval & 0x80000000)xor(val1 & 0x80000000)) {
    PS |= FLAGV;
  }
}

static void XOR(const uint16_t instr) {
  const uint16_t val1 = R[S(instr) & 7];
  const uint16_t da = aget(D(instr), WORD);
  const uint16_t val2 = memread16(da);
  const uint16_t uval = val1 ^ val2;
  PS &= 0xFFF1;
  setZ(uval);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
  memwrite16(da, uval);
}

static void SOB(const uint16_t instr) {
  uint8_t o = instr & 0xFF;
  R[S(instr) & 7]--;
  if (R[S(instr) & 7]) {
    o &= 077;
    o <<= 1;
    R[7] -= o;
  }
}

static void COM(const uint16_t instr) {
  const uint16_t da = DA(instr);
  const uint16_t uval = memread(da, L(instr)) ^ MAX(instr);
  PS &= 0xFFF0;
  PS |= FLAGC;
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  setZ(uval);
  memwrite(da, L(instr), uval);
}

static void INC(const uint16_t instr) {
  const uint16_t da = DA(instr);
  const uint16_t uval = (memread(da, L(instr)) + 1) & MAX(instr);
  PS &= 0xFFF1;
  if (uval & MSB(instr)) {
    PS |= FLAGN | FLAGV;
  }
  setZ(uval);
  memwrite(da, L(instr), uval);
}

static void _DEC(const uint16_t instr) {
  const uint16_t maxp = L(instr) == WORD ? 0x7FFF : 0x7f;
  const uint16_t da = DA(instr);
  const uint16_t uval = (memread(da, L(instr)) - 1) & MAX(instr);
  PS &= 0xFFF1;
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  if (uval == maxp) {
    PS |= FLAGV;
  }
  setZ(uval);
  memwrite(da, L(instr), uval);
}

static void NEG(const uint16_t instr) {
  const uint16_t da = DA(instr);
  const int32_t sval = (-memread(da, L(instr))) & MAX(instr);
  PS &= 0xFFF0;
  if (sval & MSB(instr)) {
    PS |= FLAGN;
  }
  if (sval == 0) {
    PS |= FLAGZ;
  } else {
    PS |= FLAGC;
  }
  if (sval == 0x8000) {
    PS |= FLAGV;
  }
  memwrite(da, L(instr), sval);
}

static void _ADC(const uint16_t instr) {
  const uint16_t da = DA(instr);
  const uint16_t uval = memread(da, L(instr));
  if (PS & FLAGC) {
    PS &= 0xFFF0;
    if ((uval + 1) & MSB(instr)) {
      PS |= FLAGN;
    }
    if (uval == MAX(instr))
      PS != FLAGZ;
    if (uval == 0077777) {
      PS |= FLAGV;
    }
    if (uval == 0177777) {
      PS |= FLAGC;
    }
    memwrite(da, L(instr), (uval + 1) & MAX(instr));
  } else {
    PS &= 0xFFF0;
    if (uval & MSB(instr)) {
      PS |= FLAGN;
    }
    setZ(uval);
  }
}

static void SBC(const uint16_t instr) {
  const uint16_t da = DA(instr);
  int32_t sval = memread(da, L(instr));
  if (PS & FLAGC) {
    PS &= 0xFFF0;
    if ((sval - 1) & MSB(instr)) {
      PS |= FLAGN;
    }
    if (sval == 1)
      PS |= FLAGZ;
    if (sval) {
      PS |= FLAGC;
    }
    if (sval == 0100000) {
      PS |= FLAGV;
    }
    memwrite(da, L(instr), (sval - 1) & MAX(instr));
  } else {
    PS &= 0xFFF0;
    if (sval & MSB(instr)) {
      PS |= FLAGN;
    }
    setZ(sval);
    if (sval == 0100000) {
      PS |= FLAGV;
    }
    PS |= FLAGC;
  }
}

static void TST(const uint16_t instr) {
  const uint16_t uval = memread(DA(instr), L(instr));
  PS &= 0xFFF0;
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  setZ(uval);
}

static void ROR(const uint16_t instr) {
  const uint16_t da = DA(instr);
  int32_t sval = memread(da, L(instr));
  if (PS & FLAGC) {
    sval |= MAX(instr) + 1;
  }
  PS &= 0xFFF0;
  if (sval & 1) {
    PS |= FLAGC;
  }
  // watch out for integer wrap around
  if (sval & (MAX(instr) + 1)) {
    PS |= FLAGN;
  }
  if (!(sval & MAX(instr)))
    PS |= FLAGZ;
  if ((sval & 1)xor(sval & (MAX(instr) + 1))) {
    PS |= FLAGV;
  }
  sval >>= 1;
  memwrite(da, L(instr), sval);
}

static void ROL(const uint16_t instr) {
  const uint16_t da = DA(instr);
  int32_t sval = memread(da, L(instr)) << 1;
  if (PS & FLAGC) {
    sval |= 1;
  }
  PS &= 0xFFF0;
  if (sval & (MAX(instr) + 1)) {
    PS |= FLAGC;
  }
  if (sval & MSB(instr)) {
    PS |= FLAGN;
  }
  if (!(sval & MAX(instr)))
    PS |= FLAGZ;
  if ((sval ^ (sval >> 1)) & MSB(instr)) {
    PS |= FLAGV;
  }
  sval &= MAX(instr);
  memwrite(da, L(instr), sval);
}

static void ASR(const uint16_t instr) {
  const uint16_t da = DA(instr);
  uint16_t uval = memread(da, L(instr));
  PS &= 0xFFF0;
  if (uval & 1) {
    PS |= FLAGC;
  }
  if (uval & MSB(instr)) {
    PS |= FLAGN;
  }
  if ((uval & MSB(instr))xor(uval & 1)) {
    PS |= FLAGV;
  }
  uval = (uval & MSB(instr)) | (uval >> 1);
  setZ(uval);
  memwrite(da, L(instr), uval);
}

static void ASL(const uint16_t instr) {
  const uint16_t da = DA(instr);
  // TODO(dfc) doesn't need to be an sval
  int32_t sval = memread(da, L(instr));
  PS &= 0xFFF0;
  if (sval & MSB(instr)) {
    PS |= FLAGC;
  }
  if (sval & (MSB(instr) >> 1)) {
    PS |= FLAGN;
  }
  if ((sval ^ (sval << 1)) & MSB(instr)) {
    PS |= FLAGV;
  }
  sval = (sval << 1) & MAX(instr);
  setZ(sval);
  memwrite(da, L(instr), sval);
}

static void SXT(const uint16_t instr) {
  const uint16_t da = DA(instr);
  if (PS & FLAGN) {
    memwrite(da, L(instr), MAX(instr));
  } else {
    PS |= FLAGZ;
    memwrite(da, L(instr), 0);
  }
}

static void JMP(const uint16_t instr) {
  const uint16_t uval = aget(D(instr), WORD);
  if (isReg(uval)) {
    printf("JMP called with register dest\n");
    panic();
  }
  R[7] = uval;
}

static void SWAB(const uint16_t instr) {
  uint16_t uval = memread(DA(instr), L(instr));
  uval = ((uval >> 8) | (uval << 8)) & 0xFFFF;
  PS &= 0xFFF0;
  setZ(uval & 0xFF);
  if (uval & 0x80) {
    PS |= FLAGN;
  }
  memwrite(DA(instr), L(instr), uval);
}

static void MARK(const uint16_t instr) {
  R[6] = R[7] + ((instr & 077) << 1);
  R[7] = R[5];
  R[5] = pop();
}

static void MFPI(const uint16_t instr) {
  const uint16_t da = aget(D(instr), WORD);
  uint16_t uval;
  if (da == 0170006) {
    // val = (curuser == prevuser) ? R[6] : (prevuser ? k.USP : KSP);
    if (curuser == prevuser) {
      uval = R[6];
    } else {
      if (prevuser) {
        uval = USP;
      } else {
        uval = KSP;
      }
    }
  } else if (isReg(da)) {
    printf("invalid MFPI instruction\n");
    panic();
    return; // unreached
  } else {
    uval = unibus::read16(mmu::decode((uint16_t)da, false, prevuser));
  }
  push(uval);
  PS &= 0xFFF0;
  PS |= FLAGC;
  setZ(uval);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
}

