davecheney/avr11/cpu.cpp
static void MTPI(const uint16_t instr) {
  const uint16_t da = aget(D(instr), WORD);
  const uint16_t uval = pop();
  if (da == 0170006) {
    if (curuser == prevuser) {
      R[6] = uval;
    } else {
      if (prevuser) {
        USP = uval;
      } else {
        KSP = uval;
      }
    }
  } else if (isReg(da)) {
    printf("invalid MTPI instrution\n");
    panic();
  } else {
    unibus::write16(mmu::decode(da, true, prevuser), uval);
  }
  PS &= 0xFFF0;
  PS |= FLAGC;
  setZ(uval);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
}

static void EMTX(const uint16_t instr) {
  uint16_t uval;
  if ((instr & 0177400) == 0104000) {
    uval = 030;
  } else if ((instr & 0177400) == 0104400) {
    uval = 034;
  } else if (instr == 3) {
    uval = 014;
  } else {
    uval = 020;
  }
  uint16_t prev = PS;
  switchmode(false);
  push(prev);
  push(R[7]);
  R[7] = unibus::read16(uval);
  PS = unibus::read16(uval + 2);
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
}

static void _RTT() {
  R[7] = pop();
  uint16_t uval = pop();
  if (curuser) {
    uval &= 047;
    uval |= PS & 0177730;
  }
  unibus::write16(0777776, uval);
}

static void RESET() {
  if (curuser) {
    return;
  }
  cons::clearterminal();
  rk11::reset();
}

void step() {
  PC = R[7];
  const uint16_t instr = unibus::read16(mmu::decode(PC, false, curuser));
  R[7] += 2;
  
  uint16_t uval;

  if (PRINTSTATE)
    printstate();

  switch ((instr >> 12) & 007) {
    case 001: // MOV
      MOV(instr);
      return;
    case 002: // CMP
      CMP(instr);
      return;
    case 003: // BIT
      BIT(instr);
      return;
    case 004: // BIC
      BIC(instr);
      return;
    case 005: // BIS
      BIS(instr);
      return;
  }
  switch ((instr >> 12) & 017) {
    case 006: // ADD
      ADD(instr);
      return;
    case 016: // SUB
      SUB(instr);
      return;
  }
  switch ((instr >> 9) & 0177) {
    case 0004: // JSR
      JSR(instr);
      return;
    case 0070: // MUL
      MUL(instr);
      return;
    case 0071: // DIV
      DIV(instr);
      return;
    case 0072: // ASH
      ASH(instr);
      return;
    case 0073: // ASHC
      ASHC(instr);
      return;
    case 0074: // XOR
      XOR(instr);
      return;
    case 0077: // SOB
      SOB(instr);
      return;
  }
  switch ((instr >> 6) & 00777) {
    case 00050: // CLR
      PS &= 0xFFF0;
      PS |= FLAGZ;
      memwrite(DA(instr), L(instr), 0);
      return;
    case 00051: // COM
      COM(instr);
      return;
    case 00052: // INC
      INC(instr);
      return;
    case 00053: // DEC
      _DEC(instr);
      return;
    case 00054: // NEG
      NEG(instr);
      return;
    case 00055: // ADC
      _ADC(instr);
      return;
    case 00056: // SBC
      SBC(instr);
      return;
    case 00057: // TST
      TST(instr);
      return;
    case 00060: // ROR
      ROR(instr);
      return;
    case 00061: // ROL
      ROL(instr);
      return;
    case 00062: // ASR
      ASR(instr);
      return;
    case 00063: // ASL
      ASL(instr);
      return;
    case 00067: // SXT
      SXT(instr);
      return;
  }
  switch (instr & 0177700) {
    case 0000100: // JMP
      JMP(instr);
      return;
    case 0000300: // SWAB
      SWAB(instr);
      return;
    case 0006400: // MARK
      MARK(instr);
      break;
    case 0006500: // MFPI
      MFPI(instr);
      return;
    case 0006600: // MTPI
      MTPI(instr);
      return;
  }
  if ((instr & 0177770) == 0000200) { // RTS
    R[7] = R[D(instr) & 7];
    R[D(instr) & 7] = pop();
    return;
  }

  switch (instr & 0177400) {
    case 0000400:
      branch(instr & 0xFF);
      return;
    case 0001000:
      if (!Z) {
        branch(instr & 0xFF);
      }
      return;
    case 0001400:
      if (Z) {
        branch(instr & 0xFF);
      }
      return;
    case 0002000:
      if (!(N xor V)) {
        branch(instr & 0xFF);
      }
      return;
    case 0002400:
      if (N xor V) {
        branch(instr & 0xFF);
      }
      return;
    case 0003000:
      if ((!(N xor V)) && (!Z)) {
        branch(instr & 0xFF);
      }
      return;
    case 0003400:
      if ((N xor V) || Z) {
        branch(instr & 0xFF);
      }
      return;
    case 0100000:
      if (!N) {
        branch(instr & 0xFF);
      }
      return;
    case 0100400:
      if (N) {
        branch(instr & 0xFF);
      }
      return;
    case 0101000:
      if ((!C) && (!Z)) {
        branch(instr & 0xFF);
      }
      return;
    case 0101400:
      if (C || Z) {
        branch(instr & 0xFF);
      }
      return;
    case 0102000:
      if (!V) {
        branch(instr & 0xFF);
      }
      return;
    case 0102400:
      if (V) {
        branch(instr & 0xFF);
      }
      return;
    case 0103000:
      if (!C) {
        branch(instr & 0xFF);
      }
      return;
    case 0103400:
      if (C) {
        branch(instr & 0xFF);
      }
      return;
  }
  if (((instr & 0177000) == 0104000) || (instr == 3) ||
      (instr == 4)) { // EMT TRAP IOT BPT
    EMTX(instr);
    return;
  }
  if ((instr & 0177740) == 0240) { // CL?, SE?
    if (instr & 020) {
      PS |= instr & 017;
    } else {
      PS &= ~instr & 017;
    }
    return;
  }
  switch (instr & 7) {
    case 00: // HALT
      if (curuser) {
        break;
      }
      printf("HALT\n");
      panic();
    case 01: // WAIT
      if (curuser) {
        break;
      }
      return;
    case 02: // RTI

    case 06: // RTT
      _RTT();
      return;
    case 05: // RESET
      RESET();
      return;
  }
  if (instr == 0170011) {
    // SETD ; not needed by UNIX, but used; therefore ignored
    return;
  }
  printf("invalid instruction\n");
  trap(INTINVAL);
}

void trapat(uint16_t vec) { // , msg string) {
  if (vec & 1) {
    printf("Thou darst calling trapat() with an odd vector number?\n");
    panic();
  }
  printf("trap: %x\n", vec);
  const uint16_t prev = PS;
  switchmode(false);
  push(prev);
  push(R[7]);

  R[7] = unibus::read16(vec);
  PS = unibus::read16(vec + 2);
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
}

void interrupt(uint8_t vec, uint8_t pri) {
  if (vec & 1) {
    printf("Thou darst calling interrupt() with an odd vector number?\n");
    panic();
  }
  // fast path
  if (itab[0].vec == 0) {
    itab[0].vec = vec;
    itab[0].pri = pri;
    return;
  }
  uint8_t i;
  for (i = 0; i < ITABN; i++) {
    if ((itab[i].vec == 0) || (itab[i].pri < pri)) {
      break;
    }
  }
  for (; i < ITABN; i++) {
    if ((itab[i].vec == 0) || (itab[i].vec >= vec)) {
      break;
    }
  }
  if (i >= ITABN) {
    printf("interrupt table full\n");
    panic();
  }
  uint8_t j;
  for (j = i + 1; j < ITABN; j++) {
    itab[j] = itab[j - 1];
  }
  itab[i].vec = vec;
  itab[i].pri = pri;
}

// pop the top interrupt off the itab.
static void popirq() {
  uint8_t i;
  for (i = 0; i < ITABN - 1; i++) {
    itab[i] = itab[i + 1];
  }
  itab[ITABN - 1].vec = 0;
  itab[ITABN - 1].pri = 0;
}

void handleinterrupt() {
  uint8_t vec = itab[0].vec;
  if (DEBUG_INTER) {
    printf("IRQ: %x\n", vec);
  }
  uint16_t vv = setjmp(trapbuf);
  if (vv == 0) {
    uint16_t prev = PS;
    switchmode(false);
    push(prev);
    push(R[7]);
  } else {
    trapat(vv);
  }

  R[7] = unibus::read16(vec);
  PS = unibus::read16(vec + 2);
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
  popirq();
}
};
